In [1]:
import pandas as pd

In [2]:
dates = ['2017-01-05 2:30 PM', 'Jan 5, 2017 14:30:00', '01/05/2017', '2017.01.05', '2017/01/05','20170105']

In [3]:
dates

['2017-01-05 2:30 PM',
 'Jan 5, 2017 14:30:00',
 '01/05/2017',
 '2017.01.05',
 '2017/01/05',
 '20170105']

In [4]:
pd.to_datetime(dates)

DatetimeIndex(['2017-01-05 14:30:00', '2017-01-05 14:30:00',
               '2017-01-05 00:00:00', '2017-01-05 00:00:00',
               '2017-01-05 00:00:00', '2017-01-05 00:00:00'],
              dtype='datetime64[ns]', freq=None)

In [5]:
dates

['2017-01-05 2:30 PM',
 'Jan 5, 2017 14:30:00',
 '01/05/2017',
 '2017.01.05',
 '2017/01/05',
 '20170105']

In [32]:
pd.to_datetime('9/11/2017' , dayfirst= True)

Timestamp('2017-11-09 00:00:00')

In [7]:
dates = ['2017-01-05 2:30 PM', 'Jan 5, 2017 14:30:00', 'abc']
pd.to_datetime(dates, errors = 'coerce')

DatetimeIndex(['2017-01-05 14:30:00', '2017-01-05 14:30:00', 'NaT'], dtype='datetime64[ns]', freq=None)

In [8]:
# pd.to_datetime([], errors='ignore')
# pd.to_datetime([], errors='corece')

In [9]:
epoch = 1567578610

In [34]:
pd.to_datetime(epoch, unit = 's')

Timestamp('2019-09-04 06:30:10')

In [11]:
pd.to_datetime([epoch], unit = 's')

DatetimeIndex(['2019-09-04 06:30:10'], dtype='datetime64[ns]', freq=None)

In [30]:
df = pd.read_clipboard(
                , parse_dates=['date'], index_col= 'date' )

SyntaxError: invalid syntax (<ipython-input-30-b139525763af>, line 1)

In [ ]:
df.head()

In [ ]:
# retrieve data for a particular month
df['2019-02']

In [ ]:
# mean of close for a particular month
df['2019-02'].close.mean()

In [ ]:
# retrieve data for a range 
df['2019-02-07' : '2019-02-01']

In [ ]:
df.close.resample('Q').mean()

In [ ]:
%matplotlib inline
df.close.resample('M').mean().plot(kind = 'bar')

In [13]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [14]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [15]:
ufo['Time'] = pd.to_datetime(ufo.Time)

In [16]:
ufo.head()

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00

In [17]:
ufo.Time.dt.hour.head()

0    22
1    20
2    14
3    13
4    19
Name: Time, dtype: int64

In [18]:
ufo.Time.dt.weekday_name.head()

0     Sunday
1     Monday
2     Sunday
3     Monday
4    Tuesday
Name: Time, dtype: object

In [19]:
ufo.Time.dt.dayofyear.head()

0    152
1    181
2     46
3    152
4    108
Name: Time, dtype: int64

In [20]:
t = '1/6/1998'
ts = pd.to_datetime(t, dayfirst= True)

In [21]:
ufo.loc[ufo.Time <= ts, :].head()

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00

In [22]:
ufo.Time.max()

Timestamp('2000-12-31 23:59:00')

In [23]:
ufo.Time.min()

Timestamp('1930-06-01 22:00:00')

In [24]:
# we can use mathematical operations 
ufo.Time.max() - ufo.Time.min()

Timedelta('25781 days 01:59:00')

In [25]:
ufo['Year'] = ufo.Time.dt.year

In [26]:
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,Year
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00,1930
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00,1930
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00,1931
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00,1931
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00,1933

In [27]:
ufo.Year.value_counts()

1999    2774
2000    2635
1998    1743
1995    1344
1997    1237
1996     851
1994     406
1978     326
1975     312
1993     292
1976     281
1974     261
1977     258
1989     247
1992     245
1980     244
1990     237
1979     237
1988     232
1973     227
1991     220
1968     218
1985     211
1987     210
1966     203
1967     196
1965     195
1986     186
1982     186
1984     177
        ...
1957      78
1962      72
1960      67
1959      57
1954      55
1958      53
1952      52
1961      50
1956      46
1947      41
1953      36
1955      33
1950      31
1951      21
1949      19
1945       9
1948       9
1944       8
1946       8
1943       5
1939       3
1942       3
1931       2
1930       2
1937       2
1941       2
1936       2
1935       1
1934       1
1933       1
Name: Year, Length: 68, dtype: int64

In [28]:
ufo.Year.value_counts().sort_index().head()

1930    2
1931    2
1933    1
1934    1
1935    1
Name: Year, dtype: int64

In [29]:
ufo.Year.value_counts().sort_index().plot()